// Libraries.
import React from "react";


const TermsOfUsePage = function (){
    /// @description Page with terms of use.
    return (<div>
        Пользовательское Соглашение
        Настоящее Пользовательское Соглашение (Далее Соглашение) регулирует отношения между владельцем notes.kirillzhosul.site (далее Заметки или Администрация) с одной стороны и пользователем сайта с другой.
        Сайт Заметки не является средством массовой информации.

        Используя сайт, Вы соглашаетесь с условиями данного соглашения.
        Если Вы не согласны с условиями данного соглашения, не используйте сайт Заметки!

        Предмет соглашения
        Администрация предоставляет пользователю право на размещение на сайте следующей информации:
        - Текстовой информации
        - Аудиоматериалов
        - Видеоматериалов
        - Фотоматериалов
        - Ссылок на материалы, размещенные на других сайтах

        Права и обязанности сторон
        Пользователь имеет право:
        - получать информацию на сайте
        - создавать информацию для сайта
        - использовать информацию сайта в личных некоммерческих целях

        Администрация имеет право:
        - по своему усмотрению и необходимости создавать, изменять, отменять правила
        - ограничивать доступ к любой информации на сайте
        - создавать, изменять, удалять информацию
        - удалять учетные записи
        - отказывать в регистрации без объяснения причин

        Пользователь обязуется:
        - не нарушать работоспособность сайта

        Администрация обязуется:
        - поддерживать работоспособность сайта за исключением случаев, когда это невозможно по независящим от Администрации причинам.
        - осуществлять разностороннюю защиту учетной записи Пользователя
        - защищать информацию, распространение которой ограничено или запрещено законами путем вынесения предупреждения либо удалением учетной записи пользователя, нарушившего правила

        Ответственность сторон
        - пользователь лично несет полную ответственность за распространяемую им информацию
        - администрация не несет никакой ответственности за достоверность информации, скопированной из других источников
        - администрация не несёт ответственность за несовпадение ожидаемых Пользователем и реально полученных услуг
        - администрация не несет никакой ответственности за услуги, предоставляемые третьими лицами
        - в случае возникновения форс-мажорной ситуации (боевые действия, чрезвычайное положение, стихийное бедствие и т. д.) Администрация не гарантирует сохранность информации, размещённой Пользователем, а также бесперебойную работу информационного ресурса

        Условия действия Соглашения
        Данное Соглашение вступает в силу при любом использовании данного сайта.
        Соглашение перестает действовать при появлении его новой версии.
        Администрация оставляет за собой право в одностороннем порядке изменять данное соглашение по своему усмотрению.
        При изменении соглашения, в некоторых случаях, администрация может оповестить пользователей удобным для нее способом.
    </div>)
}

export default TermsOfUsePage;